loadtest/results/go-read_user-20260131-113229.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /loadtest/k6/read_user.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
smoke   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
smoke   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
smoke   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 380 complete and 0 interrupted iterations
smoke   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 480 complete and 0 interrupted iterations
smoke   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 570 complete and 0 interrupted iterations
smoke   [  20% ] 10 VUs  06.0s/30s

running (0m04.3s), 10/10 VUs, 670 complete and 0 interrupted iterations
smoke   [  23% ] 10 VUs  07.0s/30s

running (0m05.3s), 10/10 VUs, 770 complete and 0 interrupted iterations
smoke   [  27% ] 10 VUs  08.0s/30s

running (0m06.3s), 10/10 VUs, 870 complete and 0 interrupted iterations
smoke   [  30% ] 10 VUs  09.0s/30s

running (0m07.3s), 10/10 VUs, 960 complete and 0 interrupted iterations
smoke   [  33% ] 10 VUs  10.0s/30s

running (0m08.3s), 10/10 VUs, 1060 complete and 0 interrupted iterations
smoke   [  37% ] 10 VUs  11.0s/30s

running (0m09.3s), 10/10 VUs, 1160 complete and 0 interrupted iterations
smoke   [  40% ] 10 VUs  12.0s/30s

running (0m10.3s), 10/10 VUs, 1260 complete and 0 interrupted iterations
smoke   [  43% ] 10 VUs  13.0s/30s

running (0m11.3s), 10/10 VUs, 1350 complete and 0 interrupted iterations
smoke   [  47% ] 10 VUs  14.0s/30s

running (0m12.3s), 10/10 VUs, 1450 complete and 0 interrupted iterations
smoke   [  50% ] 10 VUs  15.0s/30s

running (0m13.3s), 10/10 VUs, 1550 complete and 0 interrupted iterations
smoke   [  53% ] 10 VUs  16.0s/30s

running (0m14.3s), 10/10 VUs, 1640 complete and 0 interrupted iterations
smoke   [  57% ] 10 VUs  17.0s/30s

running (0m15.3s), 10/10 VUs, 1740 complete and 0 interrupted iterations
smoke   [  60% ] 10 VUs  18.0s/30s

running (0m16.3s), 10/10 VUs, 1840 complete and 0 interrupted iterations
smoke   [  63% ] 10 VUs  19.0s/30s

running (0m17.3s), 10/10 VUs, 1930 complete and 0 interrupted iterations
smoke   [  67% ] 10 VUs  20.0s/30s

running (0m18.3s), 10/10 VUs, 2030 complete and 0 interrupted iterations
smoke   [  70% ] 10 VUs  21.0s/30s

running (0m19.3s), 10/10 VUs, 2130 complete and 0 interrupted iterations
smoke   [  73% ] 10 VUs  22.0s/30s

running (0m20.3s), 10/10 VUs, 2230 complete and 0 interrupted iterations
smoke   [  77% ] 10 VUs  23.0s/30s

running (0m21.3s), 10/10 VUs, 2320 complete and 0 interrupted iterations
smoke   [  80% ] 10 VUs  24.0s/30s

running (0m22.3s), 10/10 VUs, 2420 complete and 0 interrupted iterations
smoke   [  83% ] 10 VUs  25.0s/30s

running (0m23.3s), 10/10 VUs, 2520 complete and 0 interrupted iterations
smoke   [  87% ] 10 VUs  26.0s/30s

running (0m24.3s), 10/10 VUs, 2610 complete and 0 interrupted iterations
smoke   [  90% ] 10 VUs  27.0s/30s

running (0m25.3s), 10/10 VUs, 2710 complete and 0 interrupted iterations
smoke   [  93% ] 10 VUs  28.0s/30s

running (0m26.3s), 10/10 VUs, 2810 complete and 0 interrupted iterations
smoke   [  97% ] 10 VUs  29.0s/30s

running (0m27.3s), 10/10 VUs, 2900 complete and 0 interrupted iterations
smoke   [ 100% ] 10 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<100' p(95)=3.42ms
    ✓ 'p(99)<200' p(99)=4.19ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8730    319.803627/s
    checks_succeeded...: 100.00% 8730 out of 8730
    checks_failed......: 0.00%   0 out of 8730

    ✓ status is 200
    ✓ has user id
    ✓ has email

    HTTP
    http_req_duration..............: avg=1.42ms   min=460.67µs med=1.06ms   max=5.64ms   p(90)=2.92ms   p(95)=3.42ms 
      { expected_response:true }...: avg=1.42ms   min=460.67µs med=1.06ms   max=5.64ms   p(90)=2.92ms   p(95)=3.42ms 
    http_req_failed................: 0.00%  0 out of 2911
    http_reqs......................: 2911   106.637842/s

    EXECUTION
    iteration_duration.............: avg=103.12ms min=100.63ms med=102.69ms max=116.13ms p(90)=105.14ms p(95)=105.8ms
    iterations.....................: 2910   106.601209/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 899 kB 33 kB/s
    data_sent......................: 326 kB 12 kB/s



running (0m27.3s), 00/10 VUs, 2910 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 10 VUs  30s
time="2026-01-31T08:32:56Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/loadtest/results/go-read_user-20260131-113229.json': open /loadtest/results/go-read_user-20260131-113229.json: permission denied"